DeeEmm/DIY-Flow-Bench/ESP32/DIY-Flow-Bench/sensors.cpp
	// differential pressure
	#ifdef PDIFF_SENSOR_NOT_USED
		this->_pdiffSensorType = translate.LANG_VAL_NOT_ENABLED;
	#elif defined PDIFF_SENSOR_TYPE_MPXV7007 && defined ADC_IS_ENABLED
		this->_pdiffSensorType = "SMPXV7007";
	#elif defined PDIFF_SENSOR_TYPE_LINEAR_ANALOG
		this->_pdiffSensorType = "ANALOG PIN: " + DIFF_PRESSURE_PIN;
	#else 
		this->_pdiffSensorType = translate.LANG_VAL_NOT_ENABLED;
	#endif
	
	// pitot pressure differential
    #ifdef PITOT_SENSOR_NOT_USED
		this->_pitotSensorType = translate.LANG_VAL_NOT_ENABLED;
	#elif defined PITOT_SENSOR_TYPE_MPXV7007 && defined ADC_IS_ENABLED
		this->_pitotSensorType = "SMPXV7007";
	#elif defined PITOT_SENSOR_TYPE_LINEAR_ANALOG
		this->_pitotSensorType = "ANALOG PIN: " + PITOT_PIN;
	#else 
		this->_pitotSensorType = translate.LANG_VAL_NOT_ENABLED;
	#endif
	
	// Set status values for GUI
	status.mafSensor = this->_mafSensorType;
	status.baroSensor = this->_baroSensorType;
	status.tempSensor = this->_tempSensorType;
	status.relhSensor = this->_relhSensorType;
	status.prefSensor = this->_prefSensorType;
	status.pdiffSensor = this->_pdiffSensorType;
	status.pitotSensor = this->_pitotSensorType;

	// END System status definitions

}

// REVIEW - MAF Interrupt service routine setup
/***********************************************************
  * @brief Set up MAF ISR
  *
  * We cannot call a non-static member function directly so we need to encapsulate it
  * This is part of the Voodoo
  ***/
/* TODO: temp disabled - need to reenable	
void Sensors::mafSetupISR(uint8_t irq_pin, void (*ISR_callback)(void), int value) {
  attachInterrupt(digitalPinToInterrupt(irq_pin), ISR_callback, value);
}
*/


// REVIEW - MAF Interrupt service routine
/***********************************************************
 * @brief Interrupt Service Routine for MAF Frequency measurement
 *
 * Determine how long since last triggered (Resides in RAM memory as it is faster)
 ***/
// TODO: Add IRAM_ATTR to Nova-Arduino 
/* TODO: temp disabled - need to reenable	
void IRAM_ATTR Sensors::mafFreqCountISR() {
    uint64_t TempVal = timerRead(timer);            
    PeriodCount = TempVal - StartValue;             
    StartValue = TempVal;                           
}
*/




/***********************************************************
 * Convert ADC value to millivolts
 ***/
 int Sensors::convertADCtoMillivolts(int rawVal) {

	int millivolts;
	
	#if defined ADC_TYPE_ADS1015 // 12 bit
		// 12 bits - sign bit = 11 bit mantissa = 2047 | 6.144v = max voltage (gain) of ADC
		// millivolts = ((rawVal * (6.144 / 2047)) * 1000); 
		millivolts = rawVal * 3.0014; 
	#elif defined ADC_TYPE_ADS1115 // 16 bit
		// 16 bits - sign bit = 15 bits mantissa = 32767 | 6.144v = max voltage (gain) of ADC
		// millivolts = ((rawVal * (6.144 / 32767)) * 1000); 
		millivolts = rawVal * 0.1875057;
	#endif
	
	return millivolts;
}




/***********************************************************
 * @brief getMafVolts: Returns MAF signal in Volts
 ***/
double Sensors::getMafVolts() {
	
	Hardware _hardware;

	double sensorVolts = 0.00F;
	
	#if defined MAF_SRC_IS_ADC && defined MAF_IS_ENABLED && defined ADC_IS_ENABLED
		sensorVolts = _hardware.getADCVolts(MAF_ADC_CHANNEL);
				
	#elif defined MAF_SRC_IS_PIN	
		long mafRaw = analogRead(MAF_PIN);
		sensorVolts = mafRaw * (_hardware.get3v3SupplyVolts() / 4095.0);
	#else
		sensorVolts = 1.0;
		return sensorVolts;
	#endif
	
	// Lets make sure we have a valid value to return
	if (sensorVolts > 0) {
		sensorVolts += MAF_MV_TRIMPOT;
		return sensorVolts;
	} else {
		return 0.0;
	}	
	
}



/***********************************************************
 * @brief Returns RAW MAF Sensor value (mass flow)
 *
 * @note MAF decode is done in Calculations.cpp
 ***/
int Sensors::getMafRaw() {
	
	Hardware _hardware;
	#ifdef MAF_IS_ENABLED
	Maf _mafdata;

	switch (_mafdata.outputType()) {
		
		case VOLTAGE:
		{
			#if defined MAF_SRC_IS_ADC && defined ADC_IS_ENABLED
				mafFlowRaw = _hardware.getADCRawData(MAF_ADC_CHANNEL);
				
			#elif defined MAF_SRC_IS_PIN	
				long mafFlowRaw = analogRead(MAF_PIN);
			#else
				mafFlowRaw = 1;
			#endif
		}
		break;
		
		case FREQUENCY:
		{  
			// TODO
			mafFlowRaw = 40000000.00 / PeriodCount;
			//mafFlowRaw = 40000000.00 / __mafVoodoo.PeriodCount; // NOTE: Do we need Voodoo?
		}
		break;
		
	}	
	
	return mafFlowRaw;

	#else

	return 0; // MAF is disabled so lets return 1

	#endif
}




/***********************************************************
 * Read BME280
 *
 * Based on: http://www.esp32learning.com/code/esp32-and-bme280-temperature-sensor-example.php
 ***/
void Sensors::getBME280RawData() {
	
	unsigned int buffer[24];
	
	for(int i = 0; i < 24; i++){
		// Start I2C Transmission
		Wire.beginTransmission(BME280_I2C_ADDR);
		// Select data register
		Wire.write((136+i));
		// Stop I2C Transmission
		Wire.endTransmission();
		 
		// Request 1 byte of data
		Wire.requestFrom(BME280_I2C_ADDR, 1);
		 
		// Read 24 bytes of data
		if(Wire.available() == 1){
			buffer[i] = Wire.read();
		}
	}
	 
	// Convert the data
	// temp coefficients
	this->dig_T1 = (buffer[0] & 0xff) + ((buffer[1] & 0xff) * 256);
	this->dig_T2 = buffer[2] + (buffer[3] * 256);
	this->dig_T3 = buffer[4] + (buffer[5] * 256);
	 
	// pressure coefficients
	this->dig_P1 = (buffer[6] & 0xff) + ((buffer[7] & 0xff ) * 256);
	this->dig_P2 = buffer[8] + (buffer[9] * 256);
	this->dig_P3 = buffer[10] + (buffer[11] * 256);
	this->dig_P4 = buffer[12] + (buffer[13] * 256);
	this->dig_P5 = buffer[14] + (buffer[15] * 256);
	this->dig_P6 = buffer[16] + (buffer[17] * 256);
	this->dig_P7 = buffer[18] + (buffer[19] * 256);
	this->dig_P8 = buffer[20] + (buffer[21] * 256);
	this->dig_P9 = buffer[22] + (buffer[23] * 256);
	 
	// Start I2C Transmission
	Wire.beginTransmission(BME280_I2C_ADDR);
	// Select data register
	Wire.write(161);
	// Stop I2C Transmission
	Wire.endTransmission();
	 
	// Request 1 byte of data
	Wire.requestFrom(BME280_I2C_ADDR, 1);
	 
	// Read 1 byte of data
	if(Wire.available() == 1){
		this->dig_H1 = Wire.read();
	}
	 
	for(int i = 0; i < 7; i++) {
		// Start I2C Transmission
		Wire.beginTransmission(BME280_I2C_ADDR);
		// Select data register
		Wire.write((225+i));
		// Stop I2C Transmission
		Wire.endTransmission();
		 
		// Request 1 byte of data
		Wire.requestFrom(BME280_I2C_ADDR, 1);
		 
		// Read 7 bytes of data
		if(Wire.available() == 1) {
			buffer[i] = Wire.read();
		}
	}
	 
