DeeEmm/DIY-Flow-Bench/ESP32/DIY-Flow-Bench/sensors.cpp
	// Convert the data
	// humidity coefficients
	int dig_H2 = buffer[0] + (buffer[1] * 256);
	unsigned int dig_H3 = buffer[2] & 0xFF ;
	int dig_H4 = (buffer[3] * 16) + (buffer[4] & 0xF);
	int dig_H5 = (buffer[4] / 16) + (buffer[5] * 16);
	int dig_H6 = buffer[6];
	 
	// Start I2C Transmission
	Wire.beginTransmission(BME280_I2C_ADDR);
	// Select control humidity register
	Wire.write(0xF2);
	// Humidity over sampling rate = 1
	Wire.write(0x01);
	// Stop I2C Transmission
	Wire.endTransmission();
	 
	// Start I2C Transmission
	Wire.beginTransmission(BME280_I2C_ADDR);
	// Select control measurement register
	Wire.write(0xF4);
	// Normal mode, temp and pressure over sampling rate = 1
	Wire.write(0x27);
	// Stop I2C Transmission
	Wire.endTransmission();
	 
	// Start I2C Transmission
	Wire.beginTransmission(BME280_I2C_ADDR);
	// Select config register
	Wire.write(0xF5);
	// Stand_by time = 1000ms
	Wire.write(0xA0);
	// Stop I2C Transmission
	Wire.endTransmission();
	 
	for(int i = 0; i < 8; i++) {
		// Start I2C Transmission
		Wire.beginTransmission(BME280_I2C_ADDR);
		// Select data register
		Wire.write((247+i));
		// Stop I2C Transmission
		Wire.endTransmission();
		 
		// Request 1 byte of data
		Wire.requestFrom(BME280_I2C_ADDR, 1);
		 
		// Read 8 bytes of data
		if(Wire.available() == 1) {
			data[i] = Wire.read();
		}
	}
	
}




/***********************************************************
 * @brief get Reference Pressure sensor voltage
 * @returns current PRef sensor value in Volts
 ***/
double Sensors::getPRefVolts() {

	Hardware _hardware;

	double sensorVolts = 0.0;

	#if defined PREF_SRC_ADC && defined PREF_IS_ENABLED && defined ADC_IS_ENABLED // use ADC value

		sensorVolts = _hardware.getADCVolts(PREF_ADC_CHANNEL);	

	#elif defined PREF_SRC_PIN && defined PREF_IS_ENABLED // use raw pin value

		long refPressRaw = analogRead(REF_PRESSURE_PIN);
		sensorVolts = refPressRaw * (_hardware.get3v3SupplyVolts() / 4095.0);

	#else // return a fixed value
	
		sensorVolts = 1.0;
		return sensorVolts;
	#endif

	// Lets make sure we have a valid value to return
	if (sensorVolts > 0.0) { 
		sensorVolts += PREF_MV_TRIMPOT;
		return sensorVolts;
	} else { 
		return 0.0;
	}


}





/***********************************************************
 * @brief Process Reference Pressure sensor value depending on sensor type
 * @returns Reference pressure in kPa
 * @note Default sensor MPXV7007DP - https://www.nxp.com/docs/en/data-sheet/MPXV7007.pdf
 ***/
double Sensors::getPRefValue() {

	Hardware _hardware;
	
	double sensorVal = 0.0;
	double sensorVolts = this->getPRefVolts();
	
	// Convert value to kPa according to sensor type
	#if defined PREF_SENSOR_TYPE_LINEAR_ANALOG
		sensorVal = this->getPRefVolts() * PREF_ANALOG_SCALE;
	
	#elif defined PREF_SENSOR_TYPE_MPXV7007

		// Vout = Vcc x (0.057 x sensorVal + 0.5) --- Transfer function formula from MPXV7007DP Datasheet
		// sensorVal (kPa) = (sensorVolts - 0.5 * _hardware.get5vSupplyVolts() ) / (0.057 * _hardware.get5vSupplyVolts() / 1000);
		sensorVal = ((sensorVolts / _hardware.get5vSupplyVolts()) -0.5) / 0.057;

	#else

		sensorVal = FIXED_REF_PRESS_VALUE;

	#endif

	// Lets make sure we have a valid value to return
	if (sensorVal > 0) { 
		return sensorVal;
	} else { 
		return 0.0001; // return small non zero value to prevent divide by zero errors (will be truncated to zero in display)
	}


}





/***********************************************************
 * @brief Get PDiff Volts
 * @returns Differential Pressure in Volts
 ***/
double Sensors::getPDiffVolts() {
	
	Hardware _hardware;

	double sensorVolts = 0.0;
	
	#if defined PDIFF_SRC_IS_ADC && defined PDIFF_IS_ENABLED && defined ADC_IS_ENABLED // use ADC value

		sensorVolts = _hardware.getADCVolts(PDIFF_ADC_CHANNEL);
				
	#elif defined PDIFF_SRC_IS_PIN	// Use raw pin value

		long pDiffRaw = analogRead(DIFF_PRESSURE_PIN);
		sensorVolts = pDiffRaw * (_hardware.get3v3SupplyVolts() / 4095.0);

	#else // return a fixed value

		sensorVolts = 1.0;
		return sensorVolts;

	#endif
	
	// Lets make sure we have a valid value to return
	if (sensorVolts > 0) {
		sensorVolts += PDIFF_MV_TRIMPOT;
		return sensorVolts;
	} else {
		return 0;
	}
	
}




/***********************************************************
 * @brief Get differential pressure in kPa
 * @returns Differential pressure in kPa
 * @note Default sensor is MPXV7007DP - Datasheet - https://www.nxp.com/docs/en/data-sheet/MPXV7007.pdf
 ***/
double Sensors::getPDiffValue() {

	Hardware _hardware;

	double sensorVal = 0.0;
	double sensorVolts = this->getPDiffVolts();

	// Convert value to kPa according to sensor type
	#if defined PDIFF_SENSOR_TYPE_LINEAR_ANALOG

		diffPressureKpa = getPDiffVolts() * PDIFF_ANALOG_SCALE;
	
	#elif defined PDIFF_SENSOR_TYPE_MPXV7007 // Recommended sensor

		// Vout = Vcc x (0.057 x sensorVal + 0.5) --- Transfer function formula from MPXV7007DP Datasheet
		// sensorVal = (sensorVolts - 0.5 * _hardware.get5vSupplyVolts() ) / (0.057 * _hardware.get5vSupplyVolts() / 1000);
		sensorVal = ((sensorVolts / _hardware.get5vSupplyVolts()) -0.5) / 0.057;

	#else // use fixed value

		sensorVal = FIXED_PDIFF_PRESS;

	#endif

	// Lets make sure we have a valid value to return
	if (sensorVal > 0) {
		return sensorVal;
	} else {
		return 0.0001;
	}

}




/***********************************************************
 * @brief Get pitot Volts
 * @returns Pitot Pressure in Volts
 ***/
double Sensors::getPitotVolts() {

	Hardware _hardware;

	double sensorVolts = 0.0;
	
	#if defined PITOT_SRC_IS_ADC && defined PITOT_IS_ENABLED && defined ADC_IS_ENABLED // use ADC value

		sensorVolts = _hardware.getADCVolts(PITOT_ADC_CHANNEL);

	#elif defined PDIFF_SRC_IS_PIN	// use raw pin value

		long pitotRaw = analogRead(PITOT_PIN);
		sensorVolts = pitotRaw * (_hardware.get3v3SupplyVolts() / 4095.0);

	#else // use fixed value

		sensorVolts = 1.0;
		return sensorVolts;

	#endif
	
	// Lets make sure we have a valid value to return
	if (sensorVolts > 0) {
		sensorVolts += PITOT_MV_TRIMPOT;
		return sensorVolts;
	} else {
		return 0.0;
	}
	
	
